gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
int irRawValues1[IR_SAMPLE_SIZE];
int irRawValues2[IR_SAMPLE_SIZE];
int irSampleIndex1 = 0;
int irSampleIndex2 = 0;
int irSum1 = 0;
int irSum2 = 0;
bool irInitialized1 = false;
bool irInitialized2 = false;

// Fonction pour appliquer le filtre avec adaptation progressive des aberrants
int applyOutlierFilter(int newValue, int* buffer, int& index, int& sum, bool& initialized) {
  // Si pas encore initialisé, remplir le tableau avec la première valeur
  if (!initialized) {
    for (int i = 0; i < IR_SAMPLE_SIZE; i++) {
      buffer[i] = newValue;
    }
    sum = newValue * IR_SAMPLE_SIZE;
    initialized = true;
  }
  
  // Calculer la moyenne actuelle
  int currentAverage = sum / IR_SAMPLE_SIZE;
  
  // Vérifier si la nouvelle valeur est un aberrant
  int deviation = abs(newValue - currentAverage);
  
  if (deviation > IR_OUTLIER_THRESHOLD) {
    // Valeur aberrante détectée, l'adapter progressivement
    int adaptedValue;
    if (newValue > currentAverage) {
      // Valeur au-dessus de la moyenne, limiter à moyenne + seuil
      adaptedValue = currentAverage + IR_OUTLIER_THRESHOLD;
    } else {
      // Valeur en-dessous de la moyenne, limiter à moyenne - seuil
      adaptedValue = currentAverage - IR_OUTLIER_THRESHOLD;
    }
    
    // Utiliser la valeur adaptée
    sum -= buffer[index];
    buffer[index] = adaptedValue;
    sum += adaptedValue;
    index = (index + 1) % IR_SAMPLE_SIZE;
    return sum / IR_SAMPLE_SIZE;
  } else {
    // Valeur normale, l'ajouter au filtre
    sum -= buffer[index];
    buffer[index] = newValue;
    sum += newValue;
    index = (index + 1) % IR_SAMPLE_SIZE;
    return sum / IR_SAMPLE_SIZE;
  }
}

void OnDataSent(const uint8_t *mac_addr, esp_now_send_status_t status)
{
  // Callback pour le statut d'envoi (optionnel)
}

// Callback pour la réception de données ESP-NOW
void OnDataRecv(const uint8_t *mac_addr, const uint8_t *data, int data_len)
{
  // Vérifier si c'est un paquet de données du Ksoloti
  if (data_len == sizeof(struct_ksoloti_feedback)) {
    memcpy(&incomingKsolotiData, data, sizeof(struct_ksoloti_feedback));
    
    // Vérifier le byte de démarrage et le checksum
    if (incomingKsolotiData.startByte == 0xCC) {
      uint8_t calculated_checksum = incomingKsolotiData.startByte + 
                                   incomingKsolotiData.val1 + 
                                   incomingKsolotiData.val2;
      
      if (calculated_checksum == incomingKsolotiData.checksum) {
        ksoloti_val1 = incomingKsolotiData.val1;
        ksoloti_val2 = incomingKsolotiData.val2;
        ksoloti_data_updated = true;
        
        // Serial.print("Données Ksoloti reçues: val1=");
        // Serial.print(ksoloti_val1);
        // Serial.print(", val2=");
        // Serial.println(ksoloti_val2);
      }
    }
  }
}

// Fonction pour mettre à jour un paramètre par son nom
void setParameter(const char* paramName, uint8_t value) {
  for (int i = 0; i < PRESET_SIZE; i++) {
    if (strcmp(parameters[i].name, paramName) == 0) {
      parameters[i].value = value;
      // Mettre à jour le tableau DMX
      dmxValues[parameters[i].dmxChannel - 1] = value;
      //Serial.println("Paramètre " + String(paramName) + " = " + String(value));
      return;
    }
  }
  //Serial.println("Paramètre " + String(paramName) + " non trouvé");
}

// Fonction pour obtenir la valeur d'un paramètre par son nom
uint8_t getParameter(const char* paramName) {
  for (int i = 0; i < PRESET_SIZE; i++) {
    if (strcmp(parameters[i].name, paramName) == 0) {
      return parameters[i].value;
    }
  }
  return 0;
}

// Fonction pour sauvegarder un preset
void savePreset(uint8_t presetIndex, const char* presetName) {
  if (presetIndex >= MAX_PRESETS) {
    Serial.println("Index de preset invalide");
    return;
  }
  
  // Copier le nom du preset
  strncpy(presets[presetIndex].name, presetName, 15);
  presets[presetIndex].name[15] = '\0';
  
  // Copier les valeurs des paramètres
  for (int i = 0; i < PRESET_SIZE; i++) {
    presets[presetIndex].values[i] = parameters[i].value;
  }
  
  //Serial.println("Preset " + String(presetIndex) + " sauvegardé en RAM: " + String(presetName));
}

// Fonction pour charger un preset
void loadPreset(uint8_t presetIndex) {
  if (presetIndex >= MAX_PRESETS) {
    Serial.println("Index de preset invalide");
    return;
  }
  
  // Appliquer les valeurs aux paramètres
  for (int i = 0; i < PRESET_SIZE; i++) {
    parameters[i].value = presets[presetIndex].values[i];
    dmxValues[parameters[i].dmxChannel - 1] = parameters[i].value;
  }
  
  //Serial.println("Preset " + String(presetIndex) + " chargé depuis RAM: " + String(presets[presetIndex].name));
}

// Fonction pour afficher tous les paramètres
void printParameters() {
  //Serial.println("=== Paramètres actuels ===");
  for (int i = 0; i < PRESET_SIZE; i++) {
    //Serial.println(String(parameters[i].name) + " (DMX " + String(parameters[i].dmxChannel) + "): " + String(parameters[i].value));
  }
  //Serial.println("==========================");
}

// Fonction pour initialiser les paramètres par défaut
void initializeParameters() {
  for (int i = 0; i < PRESET_SIZE; i++) {
    parameters[i].value = parameters[i].defaultValue;
    dmxValues[parameters[i].dmxChannel - 1] = parameters[i].value;
  }
  //Serial.println("Paramètres initialisés aux valeurs par défaut");
}



// Fonction pour enregistrer tous les paramètres d'un coup (24 arguments)
void setAllParameters(uint8_t autopan_depth, uint8_t pitch, uint8_t vibrato_speed, uint8_t vibrato_depth,
                     uint8_t delay_time, uint8_t delay_feedback, uint8_t osc_waveform, uint8_t gate_threshold,
                     uint8_t portamento_time, uint8_t scale, uint8_t octave_low_high, uint8_t osc2_volume,
                     uint8_t osc2_pitch_offset, uint8_t autopan_frequency, uint8_t scale_tonic,
                     uint8_t volume_drums, uint8_t trig_kick, uint8_t trig_snare, uint8_t trig_hh,
                     uint8_t master_volume, uint8_t filter_on_off, uint8_t filter_cutoff,
                     uint8_t filter_reso, uint8_t filter_type) {
  
