gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
  // Mettre à jour tous les paramètres
  parameters[0].value = autopan_depth;
  parameters[1].value = pitch;
  parameters[2].value = vibrato_speed;
  parameters[3].value = vibrato_depth;
  parameters[4].value = delay_time;
  parameters[5].value = delay_feedback;
  parameters[6].value = osc_waveform;
  parameters[7].value = gate_threshold;
  parameters[8].value = portamento_time;
  parameters[9].value = scale;
  parameters[10].value = octave_low_high;
  parameters[11].value = osc2_volume;
  parameters[12].value = osc2_pitch_offset;
  parameters[13].value = autopan_frequency;
  parameters[14].value = scale_tonic;
  parameters[15].value = volume_drums;
  parameters[16].value = trig_kick;
  parameters[17].value = trig_snare;
  parameters[18].value = trig_hh;
  parameters[19].value = master_volume;
  parameters[20].value = filter_on_off;
  parameters[21].value = filter_cutoff;
  parameters[22].value = filter_reso;
  parameters[23].value = filter_type;
  
  // Mettre à jour le tableau DMX
  for (int i = 0; i < PRESET_SIZE; i++) {
    dmxValues[parameters[i].dmxChannel - 1] = parameters[i].value;
  }
  
  //Serial.println("Tous les paramètres mis à jour");
  printParameters();
}

// Fonction pour afficher tous les presets disponibles
void printAllPresets() {
  //Serial.println("=== Presets disponibles ===");
  for (int i = 0; i < MAX_PRESETS; i++) {
    //Serial.print("Preset " + String(i) + ": " + String(presets[i].name));
    //Serial.println(" (valeurs: " + String(presets[i].values[0]) + "," + String(presets[i].values[1]) + ",...)");
  }
  //Serial.println("===========================");
}

// Fonction pour calculer la moyenne d'un tableau
int calculateAverage(int* values, int size) {
  long sum = 0;
  for (int i = 0; i < size; i++) {
    sum += values[i];
  }
  return sum / size;
}

// Fonction pour appliquer un filtre passe-bas
float applyLowPassFilter(float currentValue, float newValue, float alpha) {
  return alpha * newValue + (1.0 - alpha) * currentValue;
}

// Fonction pour stabiliser une valeur avec debouncing
int stabilizeValue(int newValue, int lastValue, int threshold) {
  int difference = abs(newValue - lastValue);
  if (difference <= threshold) {
    return lastValue; // Ignorer les petites variations
  }
  return newValue;
}

// Fonction pour lire et stabiliser un capteur IR - NOUVELLE STRATÉGIE
int readStabilizedIRSensor(int sensorPin, int* rawValues, int& sampleIndex, int& sum, bool& initialized) {
  // Lecture brute
  int rawValue = analogRead(sensorPin);
  
  // Application du filtre avec adaptation progressive des aberrants
  int filteredValue = applyOutlierFilter(rawValue, rawValues, sampleIndex, sum, initialized);
  
  return filteredValue;
}

// Fonction d'initialisation du rotary encoder (désactivée - encoder non câblé)
/*
void initializeEncoder() {
  // Configuration des pins du rotary encoder
  encoder.attachHalfQuad(ENCODER_A_PIN, ENCODER_B_PIN);
  encoder.setCount(0);
  
  // Configuration du bouton (optionnel)
  pinMode(ENCODER_BUTTON_PIN, INPUT_PULLUP);
  
  Serial.println("=== ROTARY ENCODER INITIALISÉ ===");
  Serial.println("Pins configurés:");
  Serial.print("  - Pin A (CLK): D5 (GPIO18)");
  Serial.println(" ✓");
  Serial.print("  - Pin B (DT): D6 (GPIO19)");
  Serial.println(" ✓");
  Serial.print("  - Bouton (SW): D7 (GPIO23)");
  Serial.println(" ✓");
  Serial.println("");
  Serial.println("=== CONTROLES ===");
  Serial.println("🔄 Rotation: Modifie la valeur du paramètre actuel");
  Serial.println("🔘 Bouton: Change de paramètre (cycle 0-19)");
  Serial.println("📊 Monitor: Affiche les changements en temps réel");
  Serial.println("=====================================");
}
*/

// Fonction pour gérer le rotary encoder (désactivée - encoder non câblé)
/*
void handleEncoder() {
  // Lecture de la valeur actuelle du rotary encoder
  int32_t currentEncoderValue = encoder.getCount();
  
  // Si la valeur a changé, mettre à jour le paramètre sélectionné
  if (currentEncoderValue != lastEncoderValue) {
    int32_t delta = currentEncoderValue - lastEncoderValue;
    
    // Obtenir la valeur actuelle du paramètre sélectionné
    uint8_t currentValue = parameters[selectedParameter].value;
    
    // Ajuster la valeur en fonction de la rotation
    int newValue = currentValue + (delta * 2); // Multiplier par 2 pour un contrôle plus sensible
    
    // Limiter la valeur entre 0 et 255
    if (newValue < 0) newValue = 0;
    if (newValue > 255) newValue = 255;
    
    // Mettre à jour le paramètre
    parameters[selectedParameter].value = (uint8_t)newValue;
    dmxValues[parameters[selectedParameter].dmxChannel - 1] = (uint8_t)newValue;
    
    // Afficher les informations détaillées de debug
    Serial.print("🔄 ROTATION: ");
    if (delta > 0) {
      Serial.print("+");
    }
    Serial.print(delta);
    Serial.print(" | Encoder: ");
    Serial.print(currentEncoderValue);
    Serial.print(" | ");
    Serial.print(parameters[selectedParameter].name);
    Serial.print(" (DMX ");
    Serial.print(parameters[selectedParameter].dmxChannel);
    Serial.print("): ");
    Serial.print(currentValue);
    Serial.print(" → ");
    Serial.print((uint8_t)newValue);
    Serial.print(" [");
    Serial.print((uint8_t)newValue * 100 / 255);
    Serial.println("%]");
    
    lastEncoderValue = currentEncoderValue;
  }
  
  // Gestion du bouton pour changer de paramètre
  bool buttonState = !digitalRead(ENCODER_BUTTON_PIN); // Inversé car INPUT_PULLUP
  
  if (buttonState && !encoderButtonPressed && (millis() - lastButtonPress > BUTTON_DEBOUNCE)) {
    selectedParameter = (selectedParameter + 1) % PRESET_SIZE; // Passer au paramètre suivant
    
    Serial.println("🔘 BOUTON PRESSÉ - Changement de paramètre");
    Serial.print("  📋 Paramètre ");
    Serial.print(selectedParameter);
    Serial.print("/19: '");
    Serial.print(parameters[selectedParameter].name);
    Serial.print("'");
    Serial.println("");
    Serial.print("  📡 DMX Channel: ");
    Serial.print(parameters[selectedParameter].dmxChannel);
    Serial.print(" | Valeur actuelle: ");
    Serial.print(parameters[selectedParameter].value);
    Serial.print(" [");
    Serial.print(parameters[selectedParameter].value * 100 / 255);
    Serial.println("%]");
    Serial.println("  ──────────────────────────────────────");
    
