gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
    encoderButtonPressed = true;
    lastButtonPress = millis();
  }
  
  if (!buttonState) {
    encoderButtonPressed = false;
  }
  
  // Affichage périodique du statut du rotary encoder
  if (millis() - lastEncoderStatusTime >= ENCODER_STATUS_INTERVAL) {
    Serial.println("📊 STATUT ROTARY ENCODER:");
    Serial.print("  🎯 Paramètre actuel: ");
    Serial.print(selectedParameter);
    Serial.print("/19 - '");
    Serial.print(parameters[selectedParameter].name);
    Serial.println("'");
    Serial.print("  📡 DMX Channel: ");
    Serial.print(parameters[selectedParameter].dmxChannel);
    Serial.print(" | Valeur: ");
    Serial.print(parameters[selectedParameter].value);
    Serial.print(" [");
    Serial.print(parameters[selectedParameter].value * 100 / 255);
    Serial.println("%]");
    Serial.print("  🔢 Compteur encoder: ");
    Serial.println(encoder.getCount());
    Serial.println("  ──────────────────────────────────────");
    
    lastEncoderStatusTime = millis();
  }
}
*/

/*Paramètres Ksoloti
1 autopan depth
2 pitch
3 vibrato speed
4 vibrato depth
5 delay time
6 delay feedback
7 osc waveform
8 gate threshold
9 portamento time
10 scale
11 octave low high
12 OSC 2 volume
13 OSC 2 pitch offset
14 autopan frequency
15 scale tonic
16 volume drums
17 trig kick
18 trig snare
19 trig hh
20 master volume (inverted)
21 filter on-off 
22 filter cutoff
23 filter reso
24 filter type
*/
// Fonction d'initialisation des presets
void initializePresets() {
  Serial.println("Initialisation des presets...");
  
  // Preset 0 - Simple sans effet
  setAllParameters(0, 0, 64, 10, 0, 0, 100, 0, 75, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 100, 0, 0, 0, 0);
  savePreset(0, "Simple");
  
  // Preset 1 - Simple avec effet
  setAllParameters(0, 0, 0, 0, 130, 110, 100, 0, 30, 0, 255, 0, 0, 0, 0, 0, 0, 0, 0, 100, 0, 0, 0, 0);
  savePreset(1, "Simple+Effet");
  
  // Preset 2 - Octaver and growl
  setAllParameters(0, 0, 64, 10, 90, 110, 145, 0, 75, 255, 0, 255, 140, 0, 0, 0, 0, 0, 0, 100, 0, 0, 0, 0);
  savePreset(2, "OctaverGrowl");
  
  // Preset 3 - Modern siren vibrafrenzy
  setAllParameters(0, 0, 162, 129, 140, 167, 205, 0, 108, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 100, 0, 0, 0, 0);
  savePreset(3, "ModernSiren");
  
  // Preset 4 - Classical
  setAllParameters(0, 0, 59, 16, 74, 83, 255, 0, 213, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
  savePreset(4, "Classical");
  
  // Preset 5 - Furious octaver growl feedbacker
  setAllParameters(0, 0, 221, 10, 74, 241, 255, 0, 91, 255, 0, 255, 196, 0, 0, 0, 0, 0, 0, 50, 0, 0, 0, 0);
  savePreset(5, "FuriousGrowl");
  
  // Preset 6 - À définir
  setAllParameters(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
  savePreset(6, "Preset6");
  
  // Preset 7 - À définir
  setAllParameters(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
  savePreset(7, "Preset7");
  
  // Preset 8 - À définir
  setAllParameters(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
  savePreset(8, "Preset8");
  
  // Preset 9 - À définir
  setAllParameters(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
  savePreset(9, "Preset9");
  
  Serial.println("Presets initialisés");
}

// Fonction d'initialisation de l'interface utilisateur
void initializeUserInterface() {
 
  // Configuration des boutons push
  pinMode(BUTTON_1_PIN, INPUT_PULLUP);
  pinMode(BUTTON_2_PIN, INPUT_PULLUP);
  pinMode(BUTTON_3_PIN, INPUT_PULLUP);
  
  // Initialisation du ruban WS2812B
  FastLED.addLeds<WS2812B, LED_STRIP_PIN, GRB>(leds, NUM_LEDS);
  FastLED.setBrightness(BRIGHTNESS);
  FastLED.clear();
  FastLED.show();
  
  // Initialisation de l'encodeur KY-040
  encoder.attachHalfQuad(ENCODER_A_PIN, ENCODER_B_PIN);
  encoder.setCount(0);
  pinMode(ENCODER_BUTTON_PIN, INPUT_PULLUP);
  
  // Initialisation de l'afficheur TM1637
  display.init();
  display.setBrightness(7); // 0-7
  display.clearScreen();
 
    // Configuration ADC pour une meilleure résolution
    analogReadResolution(12); // 12 bits (0-4095)

  Serial.println("Interface utilisateur initialisée");
}

// Fonction pour lire les capteurs Sharp IR avec stabilisation - NOUVELLE STRATÉGIE
void readSharpIRSensors() {
  // Lecture stabilisée du premier capteur Sharp IR
  int stabilizedValue1 = readStabilizedIRSensor(DIST_SENSOR_1_PIN, irRawValues1, irSampleIndex1, irSum1, irInitialized1);
  uint8_t sharpIRValue1 = stabilizedValue1 / 16;
  setParameter("pitch", sharpIRValue1);
  
  // Lecture stabilisée du deuxième capteur Sharp IR
  int stabilizedValue2 = readStabilizedIRSensor(DIST_SENSOR_2_PIN, irRawValues2, irSampleIndex2, irSum2, irInitialized2);
  uint8_t sharpIRValue2 = stabilizedValue2 / 16;
  setParameter("vibrato_speed", sharpIRValue2);
  
  // Debug minimal
  Serial.print("IR1: ");
  Serial.print(stabilizedValue1);
  Serial.print(" -> ");
  Serial.print(sharpIRValue1);
  Serial.print(" | IR2: ");
  Serial.print(stabilizedValue2);
  Serial.print(" -> ");
  Serial.println(sharpIRValue2);
}

// Fonction pour lire les faders
void readFaders() {
  faderValues[0] = analogRead(FADER_1_PIN) / 16; // 0-4095 -> 0-255
  faderValues[1] = analogRead(FADER_2_PIN) / 16;
  faderValues[2] = analogRead(FADER_3_PIN) / 16;
  
  // Mise à jour des paramètres selon les faders
  if (faderValues[0] != lastFaderValues[0]) {
    setParameter("filter_cutoff", faderValues[0]);
    lastFaderValues[0] = faderValues[0];
  }
  
  if (faderValues[1] != lastFaderValues[1]) {
    setParameter("filter_reso", faderValues[1]);
    lastFaderValues[1] = faderValues[1];
  }
  
  if (faderValues[2] != lastFaderValues[2]) {
    setParameter("delay_time", faderValues[2]);
    lastFaderValues[2] = faderValues[2];
  }
}

// Fonction pour gérer les boutons push
void handleButtons() {
  // Lecture des boutons
  bool button1State = !digitalRead(BUTTON_1_PIN); // Inversé car INPUT_PULLUP
  bool button2State = !digitalRead(BUTTON_2_PIN);
  bool button3State = !digitalRead(BUTTON_3_PIN);
  
  // Bouton 1 - Charger preset 0
  if (button1State && !lastButtonStates[0] && (millis() - lastButtonPress[0] > BUTTON_DEBOUNCE)) {
    loadPreset(0);
    Serial.println("Bouton 1 - Preset 0 chargé");
    lastButtonPress[0] = millis();
  }
  lastButtonStates[0] = button1State;
  
  // Bouton 2 - Charger preset 1
  if (button2State && !lastButtonStates[1] && (millis() - lastButtonPress[1] > BUTTON_DEBOUNCE)) {
    loadPreset(1);
    Serial.println("Bouton 2 - Preset 1 chargé");
    lastButtonPress[1] = millis();
  }
  lastButtonStates[1] = button2State;
  
  // Bouton 3 - Charger preset 2
  if (button3State && !lastButtonStates[2] && (millis() - lastButtonPress[2] > BUTTON_DEBOUNCE)) {
    loadPreset(2);
    Serial.println("Bouton 3 - Preset 2 chargé");
    lastButtonPress[2] = millis();
  }
  lastButtonStates[2] = button3State;
}

// Fonction pour gérer l'encodeur KY-040
void handleEncoder() {
  int32_t currentEncoderValue = encoder.getCount();
  
  // Gestion de la rotation - changement de preset
  if (currentEncoderValue != lastEncoderValue) {
    int32_t delta = currentEncoderValue - lastEncoderValue;
    
