gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
    // Afficher les valeurs brutes de l'encodeur
    Serial.print("Encodeur - Brut: ");
    Serial.print(currentEncoderValue);
    Serial.print(" | Delta: ");
    Serial.print(delta);
    
    // Utiliser le modulo 20 puis diviser par 2 pour gérer les 2 deltas par cran physique
    int32_t moduloValue = (currentEncoderValue % 20) / 2;
    int32_t lastModuloValue = (lastEncoderValue % 20) / 2;
    
    // Détecter la direction et changer de preset
    if (moduloValue != lastModuloValue) {
      // Changer de preset directement selon la valeur modulo
      selectedPreset = moduloValue % 10;
      
      // Charger le preset sélectionné
      loadPreset(selectedPreset);
      
      Serial.print(" | Modulo/2: ");
      Serial.print(moduloValue);
      Serial.print(" | Preset: ");
      Serial.print(selectedPreset);
      Serial.print(" - ");
      Serial.println(presets[selectedPreset].name);
    }
    
    lastEncoderValue = currentEncoderValue;
  }
  
  // Gestion du bouton de l'encodeur - toggle filtre on/off
  bool buttonState = !digitalRead(ENCODER_BUTTON_PIN);
  
  if (buttonState && !encoderButtonPressed && (millis() - lastEncoderButtonPress > BUTTON_DEBOUNCE)) {
    // Toggle du filtre on/off
    uint8_t currentFilterState = getParameter("filter_on_off");
    uint8_t newFilterState = (currentFilterState == 0) ? 255 : 0;
    setParameter("filter_on_off", newFilterState);
    
    Serial.print("Bouton encodeur - Filtre: ");
    Serial.println((newFilterState == 255) ? "ON" : "OFF");
    
    encoderButtonPressed = true;
    lastEncoderButtonPress = millis();
  }
  
  if (!buttonState) {
    encoderButtonPressed = false;
  }
}

// Fonction pour mettre à jour l'afficheur TM1637
void updateDisplay() {
  if (millis() - lastDisplayUpdate >= DISPLAY_UPDATE_INTERVAL) {
    // Afficher le preset sélectionné
    display.display(selectedPreset);
    
    lastDisplayUpdate = millis();
  }
}

void setup()
{
  Serial.begin(115200);
  Serial.println("=== Contrôleur Interactif ESP32 ===");
  Serial.println("Initialisation...");
  
  // Désactiver le Bluetooth pour améliorer la stabilité des lectures analogiques
  btStop();
  Serial.println("Bluetooth désactivé pour optimiser les lectures ADC");
  
  // Afficher l'adresse MAC de l'ESP32
  Serial.print("Adresse MAC ESP32: ");
  Serial.println(WiFi.macAddress());
  
  // Initialisation du tableau DMX à 0
  for (int i = 0; i < 512; i++) {
    dmxValues[i] = 0;
  }
  
  // Initialisation des paramètres
  initializeParameters();
  
  // Initialisation des presets
  initializePresets();
  
  // Chargement du preset 1 au démarrage
  loadPreset(1);
  
  // Initialisation de l'interface utilisateur
  initializeUserInterface();
  
  // Configuration ESP-NOW
  WiFi.mode(WIFI_STA);
  
  if (esp_now_init() != ESP_OK) {
    Serial.println("Erreur d'initialisation ESP-NOW");
    return;
  }
  
  esp_now_register_send_cb(OnDataSent);
  esp_now_register_recv_cb(OnDataRecv);
  
  // Configuration du peer
  memcpy(peerInfo.peer_addr, broadcastAddress, 6);
  peerInfo.channel = 0;
  peerInfo.encrypt = false;
  
  if (esp_now_add_peer(&peerInfo) != ESP_OK) {
    Serial.println("Erreur d'ajout du peer");
    return;
  }
  
  Serial.println("ESP-NOW initialisé");
  Serial.println("Fréquence d'émission: " + String(EMISSION_FREQUENCY) + "Hz");
  Serial.println("Capteurs Sharp IR sur GPIO35 et GPIO36");
  Serial.println("Faders sur GPIO32, GPIO33, GPIO34");
  Serial.println("Encodeur KY-040 sur GPIO26, GPIO27, GPIO25");
  Serial.println("Afficheur TM1637 sur GPIO18, GPIO19");
  Serial.println("Boutons push sur GPIO21, GPIO22, GPIO23");
  Serial.println("================================");
}

void sendDMXvalues()
{
  // Envoi des 4 paquets DMX (512 canaux divisés en 4 blocs de 128)
  for (int packetNumber = 0; packetNumber < 4; packetNumber++)
  {
    outgoingDMXPacket.blockNumber = packetNumber;
    
    // Remplir le paquet avec les 128 valeurs correspondantes
    for (int i = 0; i < 128; i++)
    {
      int dmxIndex = (packetNumber * 128) + i;
      if (dmxIndex < 512) {
        outgoingDMXPacket.dmxvalues[i] = dmxValues[dmxIndex];
      } else {
        outgoingDMXPacket.dmxvalues[i] = 0;
      }
    }
    
    // Envoi du paquet via ESP-NOW
    esp_err_t result = esp_now_send(broadcastAddress, (uint8_t *)&outgoingDMXPacket, sizeof(outgoingDMXPacket));
    
    if (result == ESP_OK) {
      //Serial.print(" [OK]");
    } else {
      Serial.print(" [ERREUR]");
    }
  }
  
  //Serial.println();
}

void setlights()
{
  // Utilisation de la valeur Sharp IR déjà calculée dans dmxValues
  uint8_t sharpIRValue1 = dmxValues[DMX_CHANNEL_IR_1 - 1]; // -1 car les canaux DMX commencent à 1
  
  // Canal DMX 1 : Mode de contrôle (0 = intensité rouge, 1 = autre mode, etc.)
  dmxValues[0] = 0; // Mode intensité rouge
  
  // Canal DMX 2 : Intensité rouge modulée par les valeurs Ksoloti
  // Utilisation de la division flottante pour un meilleur contrôle
  uint8_t ksoloti_modulation = (uint8_t)((float)ksoloti_val1);
  
  // Modulation finale avec la valeur Sharp IR
  dmxValues[1] = (3* ksoloti_modulation * sharpIRValue1) / 255;
  
  // Debug (optionnel)
  //Serial.print("Sharp IR DMX: "); Serial.print(sharpIRValue1);
  //Serial.print(" | Ksoloti mod: "); Serial.print(ksoloti_modulation);
  //Serial.print(" | DMX2: "); Serial.println(dmxValues[1]);
  
  // Mise à jour du ruban WS2812B avec les canaux DMX 2, 3 et 4 (RGB)
  uint8_t redValue = dmxValues[1];    // Canal DMX 2 (R)
  uint8_t greenValue = dmxValues[2];  // Canal DMX 3 (G) 
  uint8_t blueValue = dmxValues[3];   // Canal DMX 4 (B)
  
  // Appliquer la couleur RGB à tous les LEDs du ruban
  for (int i = 0; i < NUM_LEDS; i++) {
    leds[i] = CRGB(redValue, greenValue, blueValue);
  }
  
  // Mettre à jour l'affichage
  FastLED.show();
}

void testInputs() {
  // Affichage compact des valeurs brutes
  
  // Lecture des capteurs Sharp IR (valeurs brutes 0-4095)
  int irRaw1 = analogRead(DIST_SENSOR_1_PIN);
  int irRaw2 = analogRead(DIST_SENSOR_2_PIN);
  
