gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
  // Lecture des faders (valeurs brutes 0-4095)
  int fader1Raw = analogRead(FADER_1_PIN);
  int fader2Raw = analogRead(FADER_2_PIN);
  int fader3Raw = analogRead(FADER_3_PIN);
  
  // Lecture des boutons (0 ou 1)
  bool button1State = !digitalRead(BUTTON_1_PIN); // Bouton 1 sur GPIO22
  bool button2State = !digitalRead(BUTTON_2_PIN); // Bouton 2 sur GPIO21
  bool button3State = !digitalRead(BUTTON_3_PIN);
  
  // Lecture de l'encodeur
  int32_t encoderValue = encoder.getCount();
  bool encoderButtonState = !digitalRead(ENCODER_BUTTON_PIN);
  
  // Mapper les faders sur 0-255 pour DMX 2, 3, 4 (inversés)
  uint8_t fader1Mapped = (4095 - fader1Raw) / 16; // 4095-0 → 0-255
  uint8_t fader2Mapped = (4095 - fader2Raw) / 16;
  uint8_t fader3Mapped = (4095 - fader3Raw) / 16;
  
  // Assigner aux canaux DMX 2, 3, 4
  dmxValues[1] = fader1Mapped; // DMX 2 (Rouge)
  dmxValues[2] = fader2Mapped; // DMX 3 (Vert)
  dmxValues[3] = fader3Mapped; // DMX 4 (Bleu)
  
  // Affichage compact sur une ligne
  Serial.print("IR1 ");
  Serial.print(irRaw1);
  Serial.print(" | IR2 ");
  Serial.print(irRaw2);
  Serial.print(" | F1 ");
  Serial.print(fader1Raw);
  Serial.print(" | F2 ");
  Serial.print(fader2Raw);
  Serial.print(" | F3 ");
  Serial.print(fader3Raw);
  Serial.print(" | B1 ");
  Serial.print(button1State ? "1" : "0");
  Serial.print(" | B2 ");
  Serial.print(button2State ? "1" : "0");
  Serial.print(" | B3 ");
  Serial.print(button3State ? "1" : "0");
  Serial.print(" | ENC ");
  Serial.print(encoderValue);
  Serial.print(" | ENCB ");
  Serial.print(encoderButtonState ? "1" : "0");
  Serial.print(" | DMX2 ");
  Serial.print(dmxValues[1]);
  Serial.print(" | DMX3 ");
  Serial.print(dmxValues[2]);
  Serial.print(" | DMX4 ");
  Serial.print(dmxValues[3]);
  Serial.println();
  
  // Afficher le compteur sur le 4-digit display
  display.display(displayCounter);
  
  // Mettre à jour le LED strip avec les valeurs DMX 2, 3, 4
  uint8_t redValue = dmxValues[1];    // Canal DMX 2 (R)
  uint8_t greenValue = dmxValues[2];  // Canal DMX 3 (G) 
  uint8_t blueValue = dmxValues[3];   // Canal DMX 4 (B)
  
  // Appliquer la couleur RGB à tous les LEDs du ruban
  for (int i = 0; i < NUM_LEDS; i++) {
    leds[i] = CRGB(redValue, greenValue, blueValue);
  }
  
  // Mettre à jour l'affichage
  FastLED.show();
}
void loop()
{
  // Incrémenter le compteur d'affichage
  displayCounter++;
  
  if (CONTROL_TEST == 1) {
    // affichage des valeurs brutes des capteurs, boutons, faders, encodeur
    testInputs();
    delay(500);
  }
  else // fonctionnement normal
  {

 
  
  // Lecture des faders
 // readFaders();
  
  // Gestion des boutons PCF8574
  //handleButtons();
  
  // Gestion de l'encodeur KY-040
 // handleEncoder();
  
  // Mise à jour de l'afficheur TM1637
  //updateDisplay();
  
  // Émission à fréquence fixe (50Hz)
  if (millis() - lastEmissionTime >= EMISSION_INTERVAL) {
    setlights();
    sendDMXvalues();
    lastEmissionTime = millis();
  }
  
  delay(1); // Petit délai pour éviter de surcharger le CPU
}

}